Data/Final_Implemented_data/FileSize/wrr_file_test/test_wrr.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient).....done


Server Software:        SimpleHTTP/0.6
Server Hostname:        10.1.0.0
Server Port:            80

Document Path:          /test_100kb.txt
Document Length:        102400 bytes

Concurrency Level:      10
Time taken for tests:   0.460 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      10259000 bytes
HTML transferred:       10240000 bytes
Requests per second:    217.38 [#/sec] (mean)
Time per request:       46.002 [ms] (mean)
Time per request:       4.600 [ms] (mean, across all concurrent requests)
Transfer rate:          21778.66 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        9   32  13.1     34      56
Processing:     0   12   8.5     13      29
Waiting:        0   11   8.5     13      29
Total:         12   43  13.7     45      82

Percentage of the requests served within a certain time (ms)
  50%     45
  66%     49
  75%     51
  80%     55
  90%     60
  95%     64
  98%     72
  99%     82
 100%     82 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient).....done


Server Software:        SimpleHTTP/0.6
Server Hostname:        10.1.0.0
Server Port:            80

Document Path:          /test_500kb.txt
Document Length:        512000 bytes

Concurrency Level:      10
Time taken for tests:   0.659 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      51219000 bytes
HTML transferred:       51200000 bytes
Requests per second:    151.76 [#/sec] (mean)
Time per request:       65.893 [ms] (mean)
Time per request:       6.589 [ms] (mean, across all concurrent requests)
Transfer rate:          75909.21 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       13   29   9.1     27      55
Processing:     1   26  52.7     11     241
Waiting:        0   23  48.2     10     240
Total:         19   55  52.9     40     272

Percentage of the requests served within a certain time (ms)
  50%     40
  66%     47
  75%     50
  80%     57
  90%     78
  95%    235
  98%    268
  99%    272
 100%    272 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient).....done


Server Software:        SimpleHTTP/0.6
Server Hostname:        10.1.0.0
Server Port:            80

Document Path:          /test_100mb.txt
Document Length:        104857600 bytes

Concurrency Level:      10
Time taken for tests:   6.729 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      10485779300 bytes
HTML transferred:       10485760000 bytes
Requests per second:    14.86 [#/sec] (mean)
Time per request:       672.921 [ms] (mean)
Time per request:       67.292 [ms] (mean, across all concurrent requests)
Transfer rate:          1521725.84 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        3   29  18.2     27      85
Processing:   191  607 193.2    611    1077
Waiting:        3  402 191.6    399     851
Total:        217  636 191.3    639    1097

Percentage of the requests served within a certain time (ms)
  50%    639
  66%    687
  75%    709
  80%    752
  90%    932
  95%   1039
  98%   1085
  99%   1097
 100%   1097 (longest request)